package de.telran.summary;

import java.util.Scanner;

public class StringsWhile {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.println("Введите 4 строки");
    }



}


/*
Пользователь вводит строки до тех пор, пока не введёт строку quit. После этого программа должна вывести саму длинную
и самую короткую из введённых пользователем строк.
 */